<?php

/**
 * Локализация ru_RU: Россия - Русский язык
 */

return [

    /**
     * Настройки локализации календаря
     */
    'calendar' => [
        'format' => 'DD.MM.YYYY',
        'firstDay' => 1,
        'i18n' => [
            'previousMonth' => 'Назад',
            'nextMonth' => 'Вперёд',
            'months' => [
                'Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь'
            ],
            'weekdays' => [
                'Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота'
            ],
            'weekdaysShort' => [
                'Вс', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб'
            ]
        ]
    ],

    /**
     * Список телефонных масок с наваниями стран
     */
    'countries_phones' => [
        [
            'mask' =>"+7 (999) 999-99-99",
            'iso' => 'ru',
            'title' => 'Россия',
            'code' => '+7',
            'length' => 12,
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+\9\94 99-999-99-99",
            'iso' => 'az',
            'title' => 'Азербайджан',
            'code' => '+994',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+374 99-999-999",
            'iso' => 'am',
            'title' => 'Армения',
            'code' => '+374',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+375 (99) 999-99-99",
            'iso' => 'by',
            'title' => 'Беларусь',
            'code' => '+375',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+\9\95 (999) 999-999",
            'iso' => 'ge',
            'title' => 'Грузия',
            'code' => '+995',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+7 (799) 999-99-99",
            'iso' => 'kz',
            'title' => 'Казахстан',
            'code' => '+77',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+\9\96 (999) 999-999",
            'iso' => 'kg',
            'title' => 'Кыргызстан',
            'code' => '+996',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+86 (999) 999-999",
            'iso' => 'cn',
            'title' => 'Китай',
            'code' => '+86',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+373 9999-9999",
            'iso' => 'md',
            'title' => 'Молдова',
            'code' => '+373',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+\9\92 99-999-9999",
            'iso' => 'tj',
            'title' => 'Таджикистан',
            'code' => '+992',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+\9\93 9-999-9999",
            'iso' => 'tm',
            'title' => 'Туркменистан',
            'code' => '+993',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+\9\98 99-999-999",
            'iso' => 'uz',
            'title' => 'Узбекистан',
            'code' => '+998',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+38 (099) 999-99-99",
            'iso' => 'ua',
            'title' => 'Украина',
            'code' => '+380',
            'length' => 13,
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+4\9 999-999??????",
            'iso' => 'de',
            'title' => 'Германия',
            'code' => '+49',
            'min' => 8,
            'max' => 14
        ],
        [
            'mask' =>"+\972 9-999-9999",
            'iso' => 'il',
            'title' => 'Израиль',
            'code' => '+972',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+3\9 (999) 9999-999",
            'iso' => 'it',
            'title' => 'Италия',
            'code' => '+39',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+371 99-999-999",
            'iso' => 'lv',
            'title' => 'Латвия',
            'code' => '+371',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+370 (999) 99-999",
            'iso' => 'lt',
            'title' => 'Литва',
            'code' => '+370',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+48 (999) 999-999",
            'iso' => 'pl',
            'title' => 'Польша',
            'code' => '+48',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+32 999 9999???",
            'iso' => 'be',
            'title' => 'Бельгия',
            'code' => '+32',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+43 999 999999",
            'iso' => 'at',
            'title' => 'Австрия',
            'code' => '+43',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+44 9999 999999",
            'iso' => 'gb',
            'title' => 'Великобритания',
            'code' => '+44',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+\962 9 9999 9999",
            'iso' => 'jo',
            'title' => 'Иордания',
            'code' => '+962',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+31 9 99999999",
            'iso' => 'nl',
            'title' => 'Нидерланды',
            'code' => '+31',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+1 999-999-9999",
            'iso' => 'us',
            'title' => 'США',
            'code' => '+1',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+66 99 999 999",
            'iso' => 'th',
            'title' => 'Тайланд',
            'code' => '+66',
            'min' => 10,
            'max' => 10
        ],
        [
            'mask' =>"+\90 999 999 9999",
            'iso' => 'tr',
            'title' => 'Турция',
            'code' => '+90',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+33 9 99 99 99 999",
            'iso' => 'fr',
            'title' => 'Франция',
            'code' => '+33',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+385 99 999 999",
            'iso' => 'hr',
            'title' => 'Хорватия',
            'code' => '+385',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+420 999 999 999",
            'iso' => 'cz',
            'title' => 'Чехия',
            'code' => '+420',
            'min' => 12,
            'max' => 12
        ],
        [
            'mask' =>"+41 99 999 99 99",
            'iso' => 'ch',
            'title' => 'Швейцария',
            'code' => '+41',
            'min' => 11,
            'max' => 11
        ],
        [
            'mask' =>"+372 9999 9999",
            'iso' => 'ee',
            'title' => 'Эстония',
            'code' => '+372',
            'min' => 10,
            'max' => 11
        ],
        [
            'mask' =>"+47 999 99 999",
            'iso' => 'no',
            'title' => 'Норвегия',
            'code' => '+47',
            'min' => 10,
            'max' => 10
        ]

    ],

    /**
     * Список мобильных операторов, через которых возможна оплата
     */
    'payment_phone_operators' => [
        [
            'name' => 'МТС',
            'value' => 10,
            'css' => 'mts'
        ],
        [
            'name' => 'Мегафон',
            'value' => 11,
            'css' => 'megafon'
        ],
        [
            'name' => 'Билайн',
            'value' => 12,
            'css' => 'beeline'
        ]
    ],

    /**
     * Доступные способы пополнения счета
     */
    'payments_methods' => [
        [
            'name' => 'Qiwi',
            'value' => 5,
            'css' => 'qiwi'
        ],
        [
            'name' => 'Webmoney',
            'value' => 3,
            'css' => 'webmoney'
        ],
        [
            'name' => 'Яндекс.Деньги',
            'value' => 9,
            'css' => 'yamoney'
        ],
        [
            'name' => 'Сбербанк Онлайн',
            'value' => 13,
            'css' => 'sber'
        ],
        [
            'name' => 'Альфа-Клик',
            'value' => 14,
            'css' => 'alfa'
        ],
//        [
//            'name' => 'Тинькофф Банк',
//            'value' => 16,
//            'css' => 'tinkoff'
//        ],
        [
            'name' => 'Промсвязьбанк',
            'value' => 15,
            'css' => 'psb'
        ],
        [
            'name' => 'Банковская карта',
            'value' => 2,
            'css' => 'cards'
        ],
//        [
//            'name' => 'Мобильный телефон',
//            'value' => 'phone',
//            'css' => 'phone'
//        ],
        [
            'name' => 'Терминал',
            'value' => 8,
            'css' => 'term'
        ]
    ],

    /**
     * Настройки для выбора региона при платежах QIWI
     */
    'payment_qiwi_mask' => [
        [
            'mask' =>"+7 (999) 999-99-99",
            'iso' => 'ru',
            'title' => 'Россия',
            'code' => '+7'
        ],

        [
            'mask' =>"+38 (099) 999-99-99",
            'iso' => 'ua',
            'title' => 'Украина',
            'code' => '+380'
        ]
    ],

    /**
     * Доступные способы вывода средств
     */
    'outdtraws_methods' => [
        [
            'name' => 'Qiwi',
            'value' => 4,
            'css' => 'qiwi'
        ],
        [
            'name' => 'Webmoney',
            'mask' =>"R999999999999",
            'value' => 1,
            'css' => 'webmoney'
        ],
        [
            'name' => 'Яндекс.Деньги',
            'mask' =>"",
            'value' => 2,
            'css' => 'yamoney'
        ],
    ],

    /**
     * Минимальная сумма вывода средств
     */
    'outdraw_min_sum' => 300,

    /**
     * Минимальная сумма вывода средств для ИП
     */
    'outdraw_min_sum_ip' => 2000,

    /**
     * Склонения месяцев года для использования в датах
     */
    'months' =>
        [
            '1' => 'января',
            '2' => 'февраля',
            '3' => 'марта',
            '4' => 'апреля',
            '5' => 'мая',
            '6' => 'июня',
            '7' => 'июля',
            '8' => 'августа',
            '9' => 'сентября',
            '10' => 'октября',
            '11' => 'ноября',
            '12' => 'декабря'
        ],

    /**
     * Секция локализации для автоматических сообщений в чат
     * Не может использоваться в сборочном JS-локализации
     */
    'chat' => [
        'CHAT_BET' => 'Ваша работа будет стоить %s руб. Выполню за %s дней. Предоплата %s%%.',
        'CHOOSE_AUTHOR' => 'Вы приняли предложение автора. Чтобы исполнитель приступил к работе, необходимо внести предоплату.',
        'REFILL' => 'Заказчик принял ваше предложение.',
        'APPROVE_ORDER' => 'Автор считает работу выполненной. Согласование до .',
        'ACCEPT_ORDER' => 'Заказчик принял работу. Гарантийная поддержка до %s %s %sг.',
        'NO_ACCEPT_ORDER' => 'Заказчик отправил заказ на доработку. Выполнение до %s %s %sг.',
        'CHAT_BET_ADMIN' => 'Файл с выполненным заданием Вы скачаете в данном чате. Как оплатить заказ Вы узнаете здесь',
        //'PAY_ORDER_CUSTOMER' => 'Вы оплатили работу на %s%%. Автор начал работу над заказом. Выполнение до %s %s %sг.',
        'PAY_ORDER_AUTHOR' => 'Заказчик внес предоплату в размере %s%%. Вам необходимо подтвердить готовность для выполнения заказа.',
        'PAY_ORDER_AUTHOR_CONFIRMED' => 'Заказчик внес предоплату %s%%. Автор начал работу над заказом. Выполнение до %s %s %sг',
        'PAY_ORDER_FULL_AUTHOR' => 'Заказчик оплатил работу на 100%',
        'PAY_ORDER_CUSTOMER' => 'Вы внесли предоплату в размере %s руб. (%s%% от стоимости заказа).',
        'PAY_ORDER_CUSTOMER_CONFIRMED' => 'Вы оплатили работу на %s%%. Автор начал работу над заказом. Выполнение до %s %s %sг.',
        'PAY_ORDER_FULL_CUSTOMER' => 'Вы оплатили работу на 100%',
        'APPROVE_ORDER_ADMIN' => 'Работа находится на согласовании до %s (30 дней). Если работа выполнена в полном объеме, нажмите кнопку «Принять работу».
                                Если работа НЕ завершена и автор должен внести изменения, нажмите «Отправить на доработку».
                                Обратите внимание, если вы не предпримете никаких действий до %s, работа будет считаться успешно завершенной.
                                Удачной сдачи сессии!',
        'BARGAIN_ACCEPT' => 'торг: Автор снизил ставку до %s руб.',
        'TO_INCREASE_BARGAIN' => 'торг: Просьба увеличить стоимость до %s руб.',
        'TO_REDUCE_BARGAIN' => 'Просьба снизить стоимость до %s руб.',
        'BARGAIN_DECLINE' => 'торг: Автор отказался',
        'ADD_FILES' => "Добавлены файлы %s. %s",
        'ADD_FILE' => "Добавлен файл %s. %s",
        'FILE_LINK' => "(<a href='/download-order-resource/%s'>%s</a>)",
        'ADD_ARBITRAGE_BID' => 'Заказ передан на рассмотрение в Службу контроля качества. Работа по заказу приостановлена',
        'REMOVE_ARBITRAGE_BID_CUSTOMER' => 'Заявка на отмену заказа удалена заказчиком. Работа по заказу продолжается',
        'REMOVE_ARBITRAGE_BID_AUTHOR' => 'Заявка на отмену заказа удалена автором. Работа по заказу продолжается',
        'DECLINE_AUTHOR_TO_CUSTOMER' => 'Вы отказались от услуг автора по выполнению работы.',
        'DECLINE_AUTHOR_TO_AUTHOR' => 'Заказчик отказался от ваших услуг по выполнению работы.',
        'CHANGE_DATE' => 'Срок сдачи изменен с %s на %s',
    ],

    /**
     * Локализованные сообщения транзакций
     * Не может использоваться в сборочном JS-локализации
     */
    /*'transaction' => [
        \Bill\Services\ServicePayment::TYPE_REFERAL_PROFIT => 'Реферальный доход в размере %s руб. Заказ №%d.',
        \Bill\Services\ServicePayment::TYPE_PAY_BY_ORDER => 'Аванс. предоплата заказной работы #%d. ',
        \Bill\Services\ServicePayment::TYPE_ORDER_BY_AUTHOR => 'Оплата второй половины заказной работы #%d. ',
        \Bill\Services\ServicePayment::TYPE_PARTIALY_PAY_BY_ORDER => 'Аванс. предоплата 50%% заказной работы #%d.',
        \Bill\Services\ServicePayment::TYPE_ADD_MONEY => 'Пополнение баланса на %d руб.',
        \Bill\Services\ServicePayment::TYPE_CONTAINER_ADDMONEY => 'Пополнение баланса на %d руб.',
        \Bill\Services\ServicePayment::TYPE_BILLING_CONTAINER => 'оплата работ или заказов  ',
        'cancel_withdraw_autocomment' => 'Заявка отменена пользователем'
    ],*/

    /**
     * Контактная информация службы поддержки
     */
    'support' => [
        'phone' => '8-800-500-28-49',
        'email' => 'help@napishem.com',
        'working_time' => 'Ежедневно с 8:00 до 00:00 (МСК)',
        'manager_work_time' => 'Будни с 9:00 до 18:00 (МСК)',
        'wl_support_email' => 'zakaz.helper@gmail.com'
    ]

];
